# if File.exists?("~/.hashicorp.env")
#   tap "hashicorp/internal", "git@github.com:hashicorp/homebrew-internal.git"
#   tap "hashicorp/security", "git@github.com:hashicorp/homebrew-security.git"
#   brew "hashicorp/security/doormat-cli"
#   brew "hashicorp/internal/roam"
# end

tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mutagen-io/mutagen"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

# zsh things
brew "zsh"
brew "starship"
brew "olets/tap/zsh-abbr"

brew "achannarasappa/tap/ticker"
brew "ripgrep"
brew "ansible"
brew "ansifilter"
brew "asdf"
brew "autotrace"
brew "avr-gcc"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "cloc"
brew "cmake"
brew "consul-template"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "curl"
brew "dbus"
brew "delve"
brew "enscript"
brew "exercism"
brew "findutils"
brew "fish"
brew "fortune"
brew "fpp"
brew "freetds"
brew "fzf"
brew "gawk"
brew "geckodriver"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gpp"
brew "graphicsmagick"
brew "graphviz"
brew "grep"
brew "gtk+"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/hcp"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/sentinel"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/waypoint"
brew "heroku"
brew "hey"
brew "highlight"
brew "jq"
brew "librsvg"
brew "libxml2"
brew "lolcat"
brew "lua"
brew "lynx"
brew "markdown"
brew "mas"
brew "memcached"
brew "mkcert"
brew "moreutils"
brew "mosquitto"
brew "netcat"
brew "node"
brew "npm"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "python3"
brew "qmk/qmk/qmk"
brew "readline"
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "rust"
brew "shared-mime-info"
brew "sl"
brew "speedtest-cli"
brew "sqlite"
brew "ssh-copy-id"
brew "tfenv"
brew "tidy-html5"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tmuxp"
brew "todo-txt"
brew "tree"
brew "urlview"
brew "vim"
brew "watchman"
brew "webkit2png"
brew "wget"
brew "yarn"
brew "zopfli"

# python packages
brew "autopep8"
brew "flake8"
brew "ipython"
brew "pygments"
brew "pylint"
brew "sqlparse"
brew "virtualenv"
brew "virtualenvwrapper"
brew "yapf"

cask "1password"
cask "caffeine"
cask "calibre"
cask "cleanmymac"
cask "cleanshot"
cask "corelocationcli"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "font-consolas-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "gimp"
cask "google-drive"
cask "istat-menus"
cask "kobo"
cask "macdown"
cask "ngrok"
cask "obsidian"
cask "ollama"
cask "plex"
cask "plexamp"
cask "qmk-toolbox"
cask "quicklook-json"
cask "rowanj-gitx"
cask "spotify"
cask "sublime-text"
cask "synology-image-assistant"
cask "todotxt"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "xscreensaver"

# probably no longer needed
# cask "chromedriver"
# cask "postman"
# cask "sequel-pro"
# cask "sleek"
# cask "firefox"
# cask "mtmr"

# controlled by HashiCorp
# cask "google-chrome"
# cask "slack"
# cask "zoom"

# 3D printing
# cask "autodesk-fusion"
cask "bambu-studio"

# Java
# tap "adoptopenjdk/openjdk"
# brew "gradle"
# brew "jenv"
# brew "maven"
# cask "adoptopenjdk"

mas "1Password for Safari", id: 1569813296
mas "Amazon Kindle", id: 302584613
# mas "GarageBand", id: 682658836
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
mas "SwiftoDo Desktop", id: 1143641091
# mas "iMovie", id: 408981434
