tap "adoptopenjdk/openjdk"
tap "hashicorp/internal", "git@github.com:hashicorp/homebrew-internal.git"
tap "hashicorp/security", "git@github.com:hashicorp/homebrew-security.git"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mutagen-io/mutagen"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

brew "ack"
brew "ansifilter"
brew "asdf"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "cloc"
brew "cmake"
brew "consul"
brew "consul-template"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "curl"
brew "dbus"
brew "delve"
brew "enscript"
brew "exercism"
brew "findutils"
brew "fish"
brew "fortune"
brew "fpp"
brew "freetds"
brew "fzf"
brew "gawk"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "gnu-indent"
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gpp"
brew "gradle"
brew "graphicsmagick"
brew "graphviz"
brew "grep"
brew "gtk+"
brew "heroku"
brew "hey"
brew "highlight"
brew "jenv"
brew "jq"
brew "leiningen"
brew "libxml2"
brew "lolcat"
brew "lua"
brew "lynx"
brew "markdown"
brew "mas"
brew "maven"
brew "memcached"
brew "mkcert"
brew "moreutils"
brew "mosquitto"
brew "netcat"
brew "node"
brew "nomad"
brew "npm"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "python3"
brew "qmk/qmk/qmk"
brew "readline"
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "rlwrap"
brew "rpm"
brew "shared-mime-info"
brew "sl"
brew "speedtest-cli"
brew "sqlite"
brew "ssh-copy-id"
brew "svn"
brew "terraform"
brew "tfenv"
brew "tidy-html5"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tmuxp"
brew "todo-txt"
brew "tree"
brew "urlview"
brew "vault"
brew "vim", args: ["override-system-vi"]
brew "watchman"
brew "webkit2png"
brew "wget", args: ["with-iri"]
brew "yarn"
brew "zopfli"

cask "1password"
cask "adoptopenjdk"
cask "caffeine"
cask "chromedriver"
cask "corelocationcli"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-consolas-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-droid-sans-mono-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "istat-menus"
cask "kindle"
cask "kitematic"
cask "macdown"
cask "mojibar"
cask "mtmr"
cask "ngrok"
cask "obsidian"
cask "pocket-casts"
cask "postman"
cask "qmk-toolbox"
cask "quicklook-json"
cask "rowanj-gitx"
cask "sequel-pro"
cask "slack"
cask "sleek"
cask "spotify"
cask "sublime-text"
cask "todotxt"
cask "ultimaker-cura"
cask "virtualbox"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "zoom"

mas "GarageBand", id: 682658836
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SwiftoDo Desktop", id: 1143641091
mas "iMovie", id: 408981434
