# if File.exists?("~/.hashicorp.env")
#   tap "hashicorp/internal", "git@github.com:hashicorp/homebrew-internal.git"
#   tap "hashicorp/security", "git@github.com:hashicorp/homebrew-security.git"
#   brew "hashicorp/security/doormat-cli"
#   brew "hashicorp/internal/roam"
# end

#==============================================================================
# Taps
#==============================================================================
tap "hashicorp/tap"
tap "heroku/brew"
tap "mutagen-io/mutagen"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "terraform-linters/tap"

#==============================================================================
# Shell & Terminal
#==============================================================================
brew "bash"
brew "bash-completion"
brew "starship"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tmuxp"
brew "zsh"
brew "olets/tap/zsh-abbr"

#==============================================================================
# Core Utilities & Unix Tools
#==============================================================================
brew "coreutils"
brew "curl"
brew "findutils"
brew "gawk"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "moreutils"
brew "openssh"
brew "readline"
brew "rename"
brew "ssh-copy-id"
brew "tree"
brew "wget"
brew "zlib"

#==============================================================================
# Programming Languages & Runtimes
#==============================================================================
brew "gcc"
brew "go"
brew "lua"
brew "mise"                   # Version manager
brew "python3"
brew "rust"
brew "yarn"

#==============================================================================
# HashiCorp Tools
#==============================================================================
brew "consul-template"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/hcp"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/sentinel"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/waypoint"
cask "tflint"
brew "tfenv"                  # Terraform version manager

#==============================================================================
# Cloud & Infrastructure
#==============================================================================
brew "ansible"
brew "awscli"
brew "heroku/brew/heroku"

#==============================================================================
# Development Tools
#==============================================================================
brew "cmake"
brew "dbus"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "gnupg"
brew "golangci-lint"
brew "graphviz"
brew "mas"                    # Mac App Store CLI
brew "mkcert"
brew "netcat"
brew "universal-ctags"
brew "vim"
brew "watchman"

#==============================================================================
# File & Text Processing
#==============================================================================
brew "ack"
brew "ansifilter"
brew "bat"                    # Better cat
brew "cloc"                   # Count lines of code
brew "enscript"               # Text to PostScript
brew "fmt"
brew "fpp"                    # Facebook PathPicker
brew "fzf"                    # Fuzzy finder
brew "gpp"
brew "highlight"
brew "jless"                  # CLI JSON tree view
brew "jq"                     # JSON processor
brew "markdown"
brew "p7zip"
brew "pandoc"
brew "ripgrep"                # Fast grep alternative
brew "shared-mime-info"
brew "tidy-html5"
brew "urlview"
brew "zopfli"                 # Compression tool

#==============================================================================
# Graphics & Media Tools
#==============================================================================
brew "autotrace"
brew "ffmpeg"
brew "graphicsmagick"
brew "gtk+"
brew "librsvg"
brew "libxml2"
brew "lynx"
brew "webkit2png"

#==============================================================================
# Database Tools
#==============================================================================
brew "libpq"
brew "pgloader"
brew "postgresql@16"
brew "redis"
brew "sqlite"

#==============================================================================
# Keyboard/Hardware Development
#==============================================================================
brew "avr-gcc"
brew "qmk/qmk/qmk"

#==============================================================================
# Fun & Misc
#==============================================================================
brew "cowsay"
brew "exercism"               # Coding exercises
brew "fortune"
brew "hey"                    # HTTP load generator
brew "lolcat"
brew "speedtest-cli"
brew "todo-txt"

#==============================================================================
# Python Packages
#==============================================================================
brew "autopep8"
brew "flake8"
brew "pygments"
brew "pylint"
brew "sqlparse"
brew "virtualenv"
brew "virtualenvwrapper"
brew "yapf"

#==============================================================================
# Casks - Productivity & Utilities
#==============================================================================
cask "1password"
cask "cleanmymac"
cask "cleanshot"
cask "corelocationcli"
cask "disk-inventory-x"
cask "dropbox"
cask "google-drive"
cask "istat-menus"
cask "mtmr"
cask "nordvpn"
cask "synology-image-assistant"
cask "todotxt"

#==============================================================================
# Casks - Reading & Writing
#==============================================================================
cask "calibre"
cask "kobo"
cask "macdown-3000"
cask "obsidian"
cask "qlmarkdown"

#==============================================================================
# Casks - Development Tools
#==============================================================================
cask "db-browser-for-sqlite"
cask "ngrok"
cask "pgadmin4"
cask "qmk-toolbox"
cask "quicklook-json"
cask "rowanj-gitx"
cask "sublime-text"
cask "visual-studio-code"
cask "wkhtmltopdf"

#==============================================================================
# Casks - AI & ML
#==============================================================================
brew "anomalyco/tap/opencode"
cask "claude-code"

#==============================================================================
# Casks - Browsers & Communication
#==============================================================================
cask "google-chrome"
cask "slack"
cask "zoom"

#==============================================================================
# Casks - Media & Entertainment
#==============================================================================
cask "discord"
cask "gimp"
cask "plex"
cask "plexamp"
cask "pocket-casts"
cask "spotify"
cask "vlc"
cask "xscreensaver"

#==============================================================================
# Casks - 3D Printing & Hardware
#==============================================================================
cask "bambu-studio"
cask "raspberry-pi-imager"

#==============================================================================
# Casks - Fonts
#==============================================================================
cask "font-consolas-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"

#==============================================================================
# Mac App Store
#==============================================================================
mas "1Password for Safari", id: 1569813296
mas "Amazon Kindle", id: 302584613
mas "Amphetamine", id: 937984704
mas "Disk Diag", id: 672206759
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "PhotoSweeper", id: 463362050
mas "SwiftoDo Desktop", id: 1143641091

# Commented out - not regularly used
# mas "GarageBand", id: 682658836
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "iMovie", id: 408981434

#==============================================================================
# Archived/Unused
#==============================================================================
# probably no longer needed
# cask "chromedriver"
# cask "firefox"
# cask "postman"
# cask "sequel-pro"
# cask "sleek"

# Java (not currently needed)
# tap "adoptopenjdk/openjdk"
# brew "gradle"
# brew "jenv"
# brew "maven"
# cask "adoptopenjdk"
